In [12]:
import pandas as pd

df = pd.read_csv("employees.csv", parse_dates=["Start Date","Last Login Time"])

df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("category")
df.sort_values("First Name", inplace=True)


df.head(5)   #Prints first 5 values of dataset

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2020-08-10 10:20:00,61602,11.849,True,Marketing
327,Aaron,Male,1994-01-29,2020-08-10 18:48:00,58755,5.097,True,Marketing
440,Aaron,Male,1990-07-22,2020-08-10 14:53:00,52119,11.343,True,Client Services
937,Aaron,NaN,1986-01-22,2020-08-10 19:39:00,63126,18.424,False,Client Services
137,Adam,Male,2011-05-21,2020-08-10 01:45:00,95327,15.120,False,Distribution

In [8]:
len(df) #Returns no. of rows in dataset

1000

In [3]:
len(df.drop_duplicates()) #Here drop_duplicate() hasn't dropped any row as its comparing similarity for each column

1000

In [19]:
df.drop_duplicates(subset=["First Name", "Team"], keep="first").head(5)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2020-08-10 10:20:00,61602,11.849,True,Marketing
440,Aaron,Male,1990-07-22,2020-08-10 14:53:00,52119,11.343,True,Client Services
137,Adam,Male,2011-05-21,2020-08-10 01:45:00,95327,15.120,False,Distribution
141,Adam,Male,1990-12-24,2020-08-10 20:57:00,110194,14.727,True,Product
302,Adam,Male,2007-07-05,2020-08-10 11:59:00,71276,5.027,True,Human Resources

In [23]:
len(df.drop_duplicates(subset=["First Name", "Team"], keep="first"))

769

In [15]:
df.drop_duplicates(subset=["First Name"], keep="last").head(5)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
937,Aaron,NaN,1986-01-22,2020-08-10 19:39:00,63126,18.424,False,Client Services
538,Adam,Male,2010-10-08,2020-08-10 21:53:00,45181,3.491,False,Human Resources
610,Alan,Male,2012-02-17,2020-08-10 00:26:00,41453,10.084,False,Product
959,Albert,Male,1992-09-19,2020-08-10 02:35:00,45094,5.850,True,Business Development
693,Alice,Female,1995-10-16,2020-08-10 21:19:00,92799,2.782,False,Sales

In [22]:
len(df.drop_duplicates(subset=["First Name"], keep="last"))

201

In [6]:
df.drop_duplicates(subset=["First Name", "Team"], inplace=True)

df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2020-08-10 10:20:00,61602,11.849,True,Marketing
440,Aaron,Male,1990-07-22,2020-08-10 14:53:00,52119,11.343,True,Client Services
137,Adam,Male,2011-05-21,2020-08-10 01:45:00,95327,15.120,False,Distribution
141,Adam,Male,1990-12-24,2020-08-10 20:57:00,110194,14.727,True,Product
302,Adam,Male,2007-07-05,2020-08-10 11:59:00,71276,5.027,True,Human Resources